app/views/main/home.html.erb

    <%else%>
        <%= User.where(id: @id).first.name%>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 135138680], ["LIMIT", 1]]