app/controllers/main_controller.rb

  def create
    # check overlap login?
    if is_login?
      redirect_to main_path, notice: 'Please logout your account before login again!'
    else
      # check login authenticate with password?
      u = User.where(email: params[:email]).first
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "admin"], ["LIMIT", 1]]

  def market
    if role? == 'seller'
      redirect_to main_path, notice: 'You are not a buyer'
    else
      @c_default = $c_search
      @u = Market.joins(:item).select(:id ,:user_id,:name,:item_id, :price, :quantity, :category, :enable)
      @categories = Item.select(:category).distinct
---
SELECT "markets"."id", "markets"."user_id", "name", "markets"."item_id", "markets"."price", "markets"."quantity", "category", "enable" FROM "markets" INNER JOIN "items" ON "items"."id" = "markets"."item_id"
SELECT DISTINCT "items"."category" FROM "items"

  def phistory
    must_be_logged_in
    u = User.where(id: session[:id]).first
    if u and ((u.user_type == 0) or (u.user_type == 2))
      @history = Inventory.where(user_id: session[:id]).order(:created_at)
---
SELECT "inventories".* FROM "inventories" WHERE "inventories"."user_id" = ? ORDER BY "inventories"."created_at" ASC  [["user_id", 135138680]]

  def shistory
    must_be_logged_in
    u = User.where(id: session[:id]).first
    if u and ((u.user_type == 0) or (u.user_type == 1))
      @history = Inventory.where(seller_id: session[:id]).order(:created_at)
---
SELECT "inventories".* FROM "inventories" WHERE "inventories"."seller_id" = ? ORDER BY "inventories"."created_at" ASC  [["seller_id", 135138680]]

  def inventory
    must_be_logged_in
    if role? == 'buyer'
      redirect_to main_path
    end
    @inven = Market.where(user_id: session[:id])
    @items = Item.where(enable: true)
---
SELECT "markets".* FROM "markets" WHERE "markets"."user_id" = ?  [["user_id", 135138680]]
SELECT "items".* FROM "items" WHERE "items"."enable" = ?  [["enable", 1]]