app/controllers/markets_controller.rb

SELECT "markets".* FROM "markets" WHERE "markets"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
    def set_market
      @market = Market.find(params[:id])